/** 
 * Dont't edit or remove this plugin
 * ---------------------------------
 * 
 * Special thanks to adiwajshing/Baileys for Baileys (library)
 *
 * GITHUB 😺
 * 
 * 
 * Surena: https://github.com/SURENABOT
 * Creator: https://github.com/nextamir
 * Baileys: https://github.com/adiwajshing/Baileys
 * -----------------------------------------------
 * 
 * Surena is the first and best Iranian WhatsApp bot with full customization
 * You can use and customize Surena for your personal or business needs
 * Don't forget to give a star on our github page for this reposity
 * ---------------------------------------------------------------
 * 
 * Creator WaLink: https://wa.me/989301860610
 * Surena Instagram: https://instagram.com/surenabot
 * -------------------------------------------------
 * 
 * © SURENABOT (GNU General Public License v3.0)
 * 
 * ┌─────────────────────────────────────────────────────────────────────────────────────┐
 * │┌───────────────────────────────────────────────────────────────────────────────────┐│
 * ││                                                                                   ││
 * ││  ┌───────────┐   ┌─┐     ┌─┐   ┌─────────┐  ┌───────┐ ┌───     ┌─┐        /\      ││
 * ││  │    ────┌─┐│   │ │     │ │   │ ┌─────┐ │  │ ┌─────┘ │   \    │ │       /  \     ││
 * ││  \     ───┘ └┘   │ │     │ │   │ └─────┘ │  │ │       │ │\ \   │ │      / /\ \    ││
 * ││   \     \        │ │     │ │   │ ┌──- -──┘  │ └─────┐ │ │ \ \  │ │     / /──\ \   ││
 * ││    \     \       │ │     │ │   │ │   \ \    │ ┌─────┘ │ │  \ \ │ │    / ────── \  ││
 * ││ ┌────     \      │ └─────┘ │   │ │    \ \   │ └─────┐ │ │   \ \│ │   / /      \ \ ││
 * ││ └──────────┘     └─────────┘   └─┘     \_\  └───────┘ └─┘    ────┘   ──        ── ││
 * ││                                                                                   ││
 * │└─────────────────────────────────── WHATSAPP BOT ──────────────────────────────────┘│
 * └─────────────────────────────────────────────────────────────────────────────────────┘
 * */

var _0x54a915=_0x35c1;(function(_0x3b8e95,_0x44a056){var _0x38575b=_0x35c1,_0x285065=_0x3b8e95();while(!![]){try{var _0x30ba08=parseInt(_0x38575b(0x9a))/0x1*(-parseInt(_0x38575b(0x8e))/0x2)+parseInt(_0x38575b(0x93))/0x3*(parseInt(_0x38575b(0x8f))/0x4)+parseInt(_0x38575b(0x96))/0x5+-parseInt(_0x38575b(0x91))/0x6*(parseInt(_0x38575b(0x9b))/0x7)+parseInt(_0x38575b(0x94))/0x8*(parseInt(_0x38575b(0x98))/0x9)+-parseInt(_0x38575b(0x95))/0xa*(-parseInt(_0x38575b(0x9f))/0xb)+-parseInt(_0x38575b(0x97))/0xc;if(_0x30ba08===_0x44a056)break;else _0x285065['push'](_0x285065['shift']());}catch(_0x681376){_0x285065['push'](_0x285065['shift']());}}}(_0xba38,0xae5e9));const fs=require('fs');function _0x35c1(_0x5ae7a,_0x3e4a69){var _0xba3881=_0xba38();return _0x35c1=function(_0x35c16c,_0x27a74a){_0x35c16c=_0x35c16c-0x8e;var _0x1cc2b7=_0xba3881[_0x35c16c];return _0x1cc2b7;},_0x35c1(_0x5ae7a,_0x3e4a69);}function _0xba38(){var _0x468024=['714330WEjklc','./plugins/','34631YKKcIR','1848qInPSq','reply','\x0a──•','split','45177DxxEdE','8HjSobl','32ovPGDn','readdir','14394MvGbMN','exports','260112xtTbFV','96EwyReH','2910BJgVWI','4896575OKdxOi','28013364zbXuai'];_0xba38=function(){return _0x468024;};return _0xba38();}let handler=async _0x392da3=>{var _0x594c57=_0x35c1,_0xdaf1f6=[],_0x5bc342=0x0;fs[_0x594c57(0x90)](_0x594c57(0x99),(_0x478491,_0x220492)=>{var _0x324a92=_0x594c57;_0x220492['forEach'](_0x456661=>{var _0x531ced=_0x35c1;_0xdaf1f6+=(_0x5bc342+=0x1)+'.\x20'+_0x456661[_0x531ced(0x9e)]`.js`[0x0]+'\x0a';}),_0x392da3[_0x324a92(0x9c)]('Total\x20plugins:\x20'+_0x5bc342+'\x0a──•\x0a\x0a'+_0xdaf1f6+_0x324a92(0x9d));});};module[_0x54a915(0x92)]=handler;
handler.command = /^plugins$/i
handler.owner = true