/** 
 * Dont't edit or remove this plugin
 * ---------------------------------
 * 
 * Special thanks to adiwajshing/Baileys for Baileys (library)
 *
 * GITHUB 😺
 * 
 * 
 * Surena: https://github.com/SURENABOT
 * Creator: https://github.com/nextamir
 * Baileys: https://github.com/adiwajshing/Baileys
 * -----------------------------------------------
 * 
 * Surena is the first and best Iranian WhatsApp bot with full customization
 * You can use and customize Surena for your personal or business needs
 * Don't forget to give a star on our github page for this reposity
 * ---------------------------------------------------------------
 * 
 * Creator WaLink: https://wa.me/989301860610
 * Surena Instagram: https://instagram.com/surenabot
 * -------------------------------------------------
 * 
 * © SURENABOT (GNU General Public License v3.0)
 * 
 * ┌─────────────────────────────────────────────────────────────────────────────────────┐
 * │┌───────────────────────────────────────────────────────────────────────────────────┐│
 * ││                                                                                   ││
 * ││  ┌───────────┐   ┌─┐     ┌─┐   ┌─────────┐  ┌───────┐ ┌───     ┌─┐        /\      ││
 * ││  │    ────┌─┐│   │ │     │ │   │ ┌─────┐ │  │ ┌─────┘ │   \    │ │       /  \     ││
 * ││  \     ───┘ └┘   │ │     │ │   │ └─────┘ │  │ │       │ │\ \   │ │      / /\ \    ││
 * ││   \     \        │ │     │ │   │ ┌──- -──┘  │ └─────┐ │ │ \ \  │ │     / /──\ \   ││
 * ││    \     \       │ │     │ │   │ │   \ \    │ ┌─────┘ │ │  \ \ │ │    / ────── \  ││
 * ││ ┌────     \      │ └─────┘ │   │ │    \ \   │ └─────┐ │ │   \ \│ │   / /      \ \ ││
 * ││ └──────────┘     └─────────┘   └─┘     \_\  └───────┘ └─┘    ────┘   ──        ── ││
 * ││                                                                                   ││
 * │└─────────────────────────────────── WHATSAPP BOT ──────────────────────────────────┘│
 * └─────────────────────────────────────────────────────────────────────────────────────┘
 * */

function _0x24f5(_0x9c833,_0x2d6ec2){const _0x22b0db=_0x22b0();return _0x24f5=function(_0x24f558,_0x1188f3){_0x24f558=_0x24f558-0xb8;let _0x2d038f=_0x22b0db[_0x24f558];return _0x2d038f;},_0x24f5(_0x9c833,_0x2d6ec2);}(function(_0x517f13,_0x2278da){const _0x95f752=_0x24f5,_0x4e8ec0=_0x517f13();while(!![]){try{const _0x17e85f=-parseInt(_0x95f752(0xba))/0x1*(parseInt(_0x95f752(0xbc))/0x2)+-parseInt(_0x95f752(0xb8))/0x3+parseInt(_0x95f752(0xbd))/0x4+-parseInt(_0x95f752(0xc4))/0x5*(-parseInt(_0x95f752(0xc1))/0x6)+-parseInt(_0x95f752(0xbf))/0x7*(parseInt(_0x95f752(0xc5))/0x8)+parseInt(_0x95f752(0xc7))/0x9+-parseInt(_0x95f752(0xc0))/0xa*(parseInt(_0x95f752(0xbb))/0xb);if(_0x17e85f===_0x2278da)break;else _0x4e8ec0['push'](_0x4e8ec0['shift']());}catch(_0x1c9575){_0x4e8ec0['push'](_0x4e8ec0['shift']());}}}(_0x22b0,0xc62da));let handler=async(_0xf2405,{text:_0x318b04})=>{const _0x39774c=_0x24f5;if(!_0x318b04)throw'Please\x20insert\x20plugin\x20name!';_0xf2405['reply'](_0x39774c(0xc6)+Buffer[_0x39774c(0xb9)](_0x318b04,_0x39774c(0xc3))[_0x39774c(0xbe)](_0x39774c(0xc2)));};module['exports']=handler;function _0x22b0(){const _0x2a9a91=['421thUAIA','33scpYay','3334sLxKlL','4074364pmEHnH','toString','1311135tvsfEv','3379720CLjnRq','6XhxUEk','base64','utf-8','6912615fmxduH','24JgHswp','Reply\x20plugin\x20source\x20code\x20to\x20this\x20message\x0a\x0a────────•\x0aCode:\x20','7286319CbzFQI','363987RHWnYZ','from'];_0x22b0=function(){return _0x2a9a91;};return _0x22b0();}
handler.command = /^plugin$/i
handler.owner = true
